In [17]:
import sqlite3
import pandas as pd

In [18]:
conn = sqlite3.connect('rpg_db.sqlite3')
cursor = conn.cursor()

In [19]:
for row in cursor.execute("SELECT name FROM sqlite_master WHERE type='table';"):
    print(row)

('django_migrations',)
('sqlite_sequence',)
('auth_group',)
('auth_group_permissions',)
('auth_user_groups',)
('auth_user_user_permissions',)
('django_admin_log',)
('armory_item',)
('armory_weapon',)
('django_content_type',)
('auth_permission',)
('auth_user',)
('charactercreator_character_inventory',)
('charactercreator_necromancer',)
('django_session',)
('charactercreator_character',)
('charactercreator_cleric',)
('charactercreator_fighter',)
('charactercreator_mage',)
('charactercreator_thief',)

In [31]:
print('There are ' + str(list(cursor.execute("SELECT count(*) FROM charactercreator_character;"))[0][0]) + ' characters.')

There are 302 characters.

In [38]:
print(str(list(cursor.execute("SELECT count(*) FROM charactercreator_cleric;"))[0][0]) + ' clerics')
print(str(list(cursor.execute("SELECT count(*) FROM charactercreator_fighter;"))[0][0]) + ' fighters')
print(str(list(cursor.execute("SELECT count(*) FROM charactercreator_mage;"))[0][0]) + ' mages')
print(str(list(cursor.execute("SELECT count(*) FROM charactercreator_necromancer;"))[0][0]) + 'necromancers')
print(str(list(cursor.execute("SELECT count(*) FROM charactercreator_thief;"))[0][0]) + 'thieves')

75 clerics
68 fighters
108 mages
11necromancers
51thieves

In [40]:
armory_item = pd.read_sql_query("SELECT * FROM armory_item", conn)

In [42]:
type(armory_item)

pandas.core.frame.DataFrame

In [43]:
armory_item.describe() #174 items in our armory

          item_id  value  weight
count  174.000000  174.0   174.0
mean    87.500000    0.0     0.0
std     50.373604    0.0     0.0
min      1.000000    0.0     0.0
25%     44.250000    0.0     0.0
50%     87.500000    0.0     0.0
75%    130.750000    0.0     0.0
max    174.000000    0.0     0.0

In [46]:
armory_item.describe(exclude='number') #174 items in our armory

       name
count   174
unique  172
top     Neq
freq      2

In [47]:
armory_item.head()

   item_id                        name  value  weight
0        1    Libero facere dolore, as      0       0
1        2                         Qui      0       0
2        3                    Laborios      0       0
3        4  Quibusdam illo deserunt ea      0       0
4        5              Quod eveniet i      0       0

In [48]:
armory_weapon = pd.read_sql_query("SELECT * FROM armory_weapon", conn)

In [49]:
armory_weapon.head()

   item_ptr_id  power
0          138      0
1          139      0
2          140      0
3          141      0
4          142      0

In [64]:
pd.read_sql_query("SELECT count(*) FROM armory_weapon;", conn)

   count(*)
0        37